#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`
<details><summary>Show Plan</summary>

```diff

terraform
data.archive_file.archive_binary: Reading...
data.archive_file.archive_binary: Read complete after 0s [id=b41af55d90c49249944532f57bc86cf70173923e]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.web_bucket will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "web_bucket" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:GetObject",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
+           sid       = "Allow CloudFront"

+           principals {
+               identifiers = [
+                   (known after apply),
                ]
+               type        = "AWS"
            }
        }
    }

  # aws_cloudfront_distribution.web will be created
+   resource "aws_cloudfront_distribution" "web" {
+       arn                            = (known after apply)
+       caller_reference               = (known after apply)
+       default_root_object            = "index.html"
+       domain_name                    = (known after apply)
+       enabled                        = true
+       etag                           = (known after apply)
+       hosted_zone_id                 = (known after apply)
+       http_version                   = "http2"
+       id                             = (known after apply)
+       in_progress_validation_batches = (known after apply)
+       is_ipv6_enabled                = false
+       last_modified_time             = (known after apply)
+       price_class                    = "PriceClass_All"
+       retain_on_delete               = false
+       status                         = (known after apply)
+       tags_all                       = (known after apply)
+       trusted_key_groups             = (known after apply)
+       trusted_signers                = (known after apply)
+       wait_for_deployment            = true

+       custom_error_response {
+           error_code         = 403
+           response_code      = 200
+           response_page_path = "/"
        }

+       default_cache_behavior {
+           allowed_methods        = [
+               "GET",
+               "HEAD",
            ]
+           cached_methods         = [
+               "GET",
+               "HEAD",
            ]
+           compress               = false
+           default_ttl            = 20
+           max_ttl                = 30
+           min_ttl                = 0
+           target_origin_id       = (known after apply)
+           trusted_key_groups     = (known after apply)
+           trusted_signers        = (known after apply)
+           viewer_protocol_policy = "redirect-to-https"

+           forwarded_values {
+               headers                 = (known after apply)
+               query_string            = false
+               query_string_cache_keys = (known after apply)

+               cookies {
+                   forward           = "none"
+                   whitelisted_names = (known after apply)
                }
            }
        }

+       origin {
+           connection_attempts = 3
+           connection_timeout  = 10
+           domain_name         = (known after apply)
+           origin_id           = (known after apply)

+           s3_origin_config {
+               origin_access_identity = (known after apply)
            }
        }

+       restrictions {
+           geo_restriction {
+               locations        = (known after apply)
+               restriction_type = "none"
            }
        }

+       viewer_certificate {
+           cloudfront_default_certificate = true
+           minimum_protocol_version       = "TLSv1"
        }
    }

  # aws_cloudfront_origin_access_identity.web will be created
+   resource "aws_cloudfront_origin_access_identity" "web" {
+       caller_reference                = (known after apply)
+       cloudfront_access_identity_path = (known after apply)
+       etag                            = (known after apply)
+       iam_arn                         = (known after apply)
+       id                              = (known after apply)
+       s3_canonical_user_id            = (known after apply)
    }

  # aws_cloudwatch_log_group.lambda_log will be created
+   resource "aws_cloudwatch_log_group" "lambda_log" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       name              = "/aws/lambda/server"
+       retention_in_days = 14
+       tags_all          = (known after apply)
    }

  # aws_iam_policy.lambda_logging will be created
+   resource "aws_iam_policy" "lambda_logging" {
+       arn         = (known after apply)
+       description = "IAM policy for logging from server lambda"
+       id          = (known after apply)
+       name        = "lambda_logging"
+       path        = "/"
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "logs:CreateLogGroup",
+                           "logs:CreateLogStream",
+                           "logs:PutLogEvents",
                        ]
+                       Effect   = "Allow"
+                       Resource = "arn:aws:logs:*:*:*"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id   = (known after apply)
+       tags_all    = (known after apply)
    }

  # aws_iam_policy_attachment.lambda_log will be created
+   resource "aws_iam_policy_attachment" "lambda_log" {
+       id         = (known after apply)
+       name       = "lambda_log"
+       policy_arn = (known after apply)
+       roles      = [
+           "iam_for_lambda",
        ]
    }

  # aws_iam_role.for_lambda will be created
+   resource "aws_iam_role" "for_lambda" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "lambda.amazonaws.com"
                        }
+                       Sid       = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "iam_for_lambda"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # aws_lambda_function.server will be created
+   resource "aws_lambda_function" "server" {
+       architectures                  = (known after apply)
+       arn                            = (known after apply)
+       filename                       = "./function_payload.zip"
+       function_name                  = "server"
+       handler                        = "app"
+       id                             = (known after apply)
+       invoke_arn                     = (known after apply)
+       last_modified                  = (known after apply)
+       memory_size                    = 128
+       package_type                   = "Zip"
+       publish                        = false
+       qualified_arn                  = (known after apply)
+       reserved_concurrent_executions = -1
+       role                           = (known after apply)
+       runtime                        = "go1.x"
+       signing_job_arn                = (known after apply)
+       signing_profile_version_arn    = (known after apply)
+       source_code_hash               = "1fadpI/SBgYvpoR+qqeKX5sQeMZEUYr4zy+keJ6Hkfk="
+       source_code_size               = (known after apply)
+       tags_all                       = (known after apply)
+       timeout                        = 3
+       version                        = (known after apply)

+       ephemeral_storage {
+           size = (known after apply)
        }

+       tracing_config {
+           mode = (known after apply)
        }
    }

  # aws_lambda_function_url.endpoint will be created
+   resource "aws_lambda_function_url" "endpoint" {
+       authorization_type = "NONE"
+       function_arn       = (known after apply)
+       function_name      = "server"
+       function_url       = (known after apply)
+       id                 = (known after apply)
+       url_id             = (known after apply)

+       cors {
+           allow_headers = [
+               "*",
            ]
+           allow_methods = [
+               "*",
            ]
+           allow_origins = (known after apply)
+           max_age       = 60
        }
    }

  # aws_s3_bucket.web will be created
+   resource "aws_s3_bucket" "web" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = (known after apply)
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = "flat35hd99oiwie"
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags_all                    = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule {
+           allowed_headers = (known after apply)
+           allowed_methods = (known after apply)
+           allowed_origins = (known after apply)
+           expose_headers  = (known after apply)
+           max_age_seconds = (known after apply)
        }

+       grant {
+           id          = (known after apply)
+           permissions = (known after apply)
+           type        = (known after apply)
+           uri         = (known after apply)
        }

+       lifecycle_rule {
+           abort_incomplete_multipart_upload_days = (known after apply)
+           enabled                                = (known after apply)
+           id                                     = (known after apply)
+           prefix                                 = (known after apply)
+           tags                                   = (known after apply)

+           expiration {
+               date                         = (known after apply)
+               days                         = (known after apply)
+               expired_object_delete_marker = (known after apply)
            }

+           noncurrent_version_expiration {
+               days = (known after apply)
            }

+           noncurrent_version_transition {
+               days          = (known after apply)
+               storage_class = (known after apply)
            }

+           transition {
+               date          = (known after apply)
+               days          = (known after apply)
+               storage_class = (known after apply)
            }
        }

+       logging {
+           target_bucket = (known after apply)
+           target_prefix = (known after apply)
        }

+       object_lock_configuration {
+           object_lock_enabled = (known after apply)

+           rule {
+               default_retention {
+                   days  = (known after apply)
+                   mode  = (known after apply)
+                   years = (known after apply)
                }
            }
        }

+       replication_configuration {
+           role = (known after apply)

+           rules {
+               delete_marker_replication_status = (known after apply)
+               id                               = (known after apply)
+               prefix                           = (known after apply)
+               priority                         = (known after apply)
+               status                           = (known after apply)

+               destination {
+                   account_id         = (known after apply)
+                   bucket             = (known after apply)
+                   replica_kms_key_id = (known after apply)
+                   storage_class      = (known after apply)

+                   access_control_translation {
+                       owner = (known after apply)
                    }

+                   metrics {
+                       minutes = (known after apply)
+                       status  = (known after apply)
                    }

+                   replication_time {
+                       minutes = (known after apply)
+                       status  = (known after apply)
                    }
                }

+               filter {
+                   prefix = (known after apply)
+                   tags   = (known after apply)
                }

+               source_selection_criteria {
+                   sse_kms_encrypted_objects {
+                       enabled = (known after apply)
                    }
                }
            }
        }

+       server_side_encryption_configuration {
+           rule {
+               bucket_key_enabled = (known after apply)

+               apply_server_side_encryption_by_default {
+                   kms_master_key_id = (known after apply)
+                   sse_algorithm     = (known after apply)
                }
            }
        }

+       versioning {
+           enabled    = (known after apply)
+           mfa_delete = (known after apply)
        }

+       website {
+           error_document           = (known after apply)
+           index_document           = (known after apply)
+           redirect_all_requests_to = (known after apply)
+           routing_rules            = (known after apply)
        }
    }

  # aws_s3_bucket_acl.web will be created
+   resource "aws_s3_bucket_acl" "web" {
+       acl    = "private"
+       bucket = (known after apply)
+       id     = (known after apply)

+       access_control_policy {
+           grant {
+               permission = (known after apply)

+               grantee {
+                   display_name  = (known after apply)
+                   email_address = (known after apply)
+                   id            = (known after apply)
+                   type          = (known after apply)
+                   uri           = (known after apply)
                }
            }

+           owner {
+               display_name = (known after apply)
+               id           = (known after apply)
            }
        }
    }

  # aws_s3_bucket_policy.web will be created
+   resource "aws_s3_bucket_policy" "web" {
+       bucket = (known after apply)
+       id     = (known after apply)
+       policy = (known after apply)
    }

  # aws_s3_bucket_website_configuration.web will be created
+   resource "aws_s3_bucket_website_configuration" "web" {
+       bucket           = (known after apply)
+       id               = (known after apply)
+       routing_rules    = (known after apply)
+       website_domain   = (known after apply)
+       website_endpoint = (known after apply)

+       error_document {
+           key = "index.html"
        }

+       index_document {
+           suffix = "index.html"
        }

+       routing_rule {
+           condition {
+               http_error_code_returned_equals = (known after apply)
+               key_prefix_equals               = (known after apply)
            }

+           redirect {
+               host_name               = (known after apply)
+               http_redirect_code      = (known after apply)
+               protocol                = (known after apply)
+               replace_key_prefix_with = (known after apply)
+               replace_key_with        = (known after apply)
            }
        }
    }

  # aws_s3_object.contents["assets/index.8b67f8c9.js"] will be created
+   resource "aws_s3_object" "contents" {
+       acl                    = "private"
+       bucket                 = (known after apply)
+       bucket_key_enabled     = (known after apply)
+       content_type           = "application/javascript; charset=utf-8"
+       etag                   = "665e9f2df4d8c313725beffefc0518ee"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "assets/index.8b67f8c9.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "./front/dist/assets/index.8b67f8c9.js"
+       storage_class          = (known after apply)
+       tags_all               = (known after apply)
+       version_id             = (known after apply)
    }

  # aws_s3_object.contents["index.html"] will be created
+   resource "aws_s3_object" "contents" {
+       acl                    = "private"
+       bucket                 = (known after apply)
+       bucket_key_enabled     = (known after apply)
+       content_type           = "text/html"
+       etag                   = "50122674d3231b5aa37d593c4eda8477"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "index.html"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "./front/dist/index.html"
+       storage_class          = (known after apply)
+       tags_all               = (known after apply)
+       version_id             = (known after apply)
    }

  # aws_s3_object.contents["vite.svg"] will be created
+   resource "aws_s3_object" "contents" {
+       acl                    = "private"
+       bucket                 = (known after apply)
+       bucket_key_enabled     = (known after apply)
+       content_type           = (known after apply)
+       etag                   = "8e3a10e157f75ada21ab742c022d5430"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "vite.svg"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "./front/dist/vite.svg"
+       storage_class          = (known after apply)
+       tags_all               = (known after apply)
+       version_id             = (known after apply)
    }

Plan: 15 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   api_endpoint_url = (known after apply)
+   web_url          = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @flat35hd99, Action: `pull_request`*